bostromdev/Radiance3D/firmware/controller/sdkconfig.defaults
# ESP-IDF v5.5 baseline for the provisional ESP-WROOM-32 controller.
CONFIG_IDF_TARGET="esp32"
CONFIG_FREERTOS_HZ=1000

# The USB-UART0 line is the structured host protocol.  Leave the ESP-IDF
# console disabled so ESP_LOG output cannot corrupt that line protocol.
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y

# Safety defaults. Physical brownout behavior still requires hardware testing.
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5

# E-stop and GPTimer callbacks keep their GPIO/timer control path available
# while flash cache is disabled.  All callback-reachable wrapper code is
# marked IRAM_ATTR and its state is static DRAM.
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
CONFIG_GPTIMER_ISR_CACHE_SAFE=y
CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM=y

CONFIG_RADIANCE3D_HOST_HEARTBEAT_TIMEOUT_MS=2000
CONFIG_RADIANCE3D_TASK_WDT_TIMEOUT_MS=5000
CONFIG_RADIANCE3D_PROTOCOL_TASK_STACK=4096
CONFIG_RADIANCE3D_MOTION_TASK_STACK=6144
CONFIG_RADIANCE3D_SAFETY_TASK_STACK=3072
CONFIG_RADIANCE3D_DIAGNOSTICS_TASK_STACK=3072
CONFIG_RADIANCE3D_DIAGNOSTICS_INTERVAL_MS=1000
